<template>
  <main class="main">
    <div class="container">
      <UITheBreadcrumbs :items="breadcrumbs"></UITheBreadcrumbs>
    </div>

    <div class="container">
      <div class="article">
        <div class="article__content">
          <h1>Политика конфиденциальности и согласие на обработку данных</h1>

          <br />1. ОБЩИЕ ПОЛОЖЕНИЯ<br />
          1.1. Настоящая Политика в отношении обработки персональных данных
          (далее – Политика) составлена в соответствии с требованиями
          Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и
          определяет порядок обработки персональных данных и меры по обеспечению
          безопасности персональных данных, предпринимаемые ИП ИП Озолина Влада
          Владимировна, ИНН: 505008935552, ОГРН/ОГРНИП: 321508100655170, адрес:
          Москва, ул. Подъемная, 14/29 (далее – Оператор).<br />1.2. Оператор
          ставит своей важнейшей целью и условием осуществления своей
          деятельности соблюдение прав и свобод человека и гражданина при
          обработке его персональных данных, в том числе защиты прав на
          неприкосновенность частной жизни, личную и семейную тайну.<br />1.3.
          Настоящая Политика Оператора в отношении обработки персональных данных
          применяется ко всей информации, которую Оператор может получить о
          посетителях веб-сайта https://vladagroup.ru/ (далее – Сайт).<br /><br />2.
          ОСНОВНЫЕ ПОНЯТИЯ, ИСПОЛЬЗУЕМЫЕ В ПОЛИТИКЕ<br />2.1. Автоматизированная
          обработка персональных данных – обработка персональных данных с
          помощью средств вычислительной техники.<br />2.2. Блокирование
          персональных данных – временное прекращение обработки персональных
          данных (за исключением случаев, если обработка необходима для
          уточнения персональных данных).<br />2.3. Веб-сайт – совокупность
          графических и информационных материалов, а также программ для ЭВМ и
          баз данных, обеспечивающих их доступность в сети интернет по сетевому
          адресу https://vladagroup.ru/.<br />2.4. Информационная система
          персональных данных — совокупность содержащихся в базах данных
          персональных данных, и обеспечивающих их обработку информационных
          технологий и технических средств.<br />2.5. Обезличивание персональных
          данных — действия, в результате которых невозможно определить без
          использования дополнительной информации принадлежность персональных
          данных конкретному Пользователю или иному субъекту персональных
          данных.<br />2.6. Обработка персональных данных – любое действие
          (операция) или совокупность действий (операций), совершаемых с
          использованием средств автоматизации или без использования таких
          средств с персональными данными, включая сбор, запись, систематизацию,
          накопление, хранение, уточнение (обновление, изменение), извлечение,
          использование, передачу (распространение, предоставление, доступ),
          обезличивание, блокирование, удаление, уничтожение персональных
          данных.<br />2.7. Оператор – государственный орган, муниципальный
          орган, юридическое или физическое лицо, самостоятельно или совместно с
          другими лицами организующие и (или) осуществляющие обработку
          персональных данных, а также определяющие цели обработки персональных
          данных, состав персональных данных, подлежащих обработке, действия
          (операции), совершаемые с персональными данными.<br />2.8.
          Персональные данные – любая информация, относящаяся прямо или косвенно
          к определенному или определяемому Пользователю веб-сайта
          https://vladagroup.ru/.<br />2.9. Пользователь – любой посетитель
          веб-сайта https://vladagroup.ru/.<br />2.10. Предоставление
          персональных данных – действия, направленные на раскрытие персональных
          данных определенному лицу или определенному кругу лиц.<br />2.11.
          Распространение персональных данных – любые действия, направленные на
          раскрытие персональных данных неопределенному кругу лиц (передача
          персональных данных) или на ознакомление с персональными данными
          неограниченного круга лиц, в том числе обнародование персональных
          данных в средствах массовой информации, размещение в
          информационно-телекоммуникационных сетях или предоставление доступа к
          персональным данным каким-либо иным способом.<br />2.12.
          Трансграничная передача персональных данных – передача персональных
          данных на территорию иностранного государства органу власти
          иностранного государства, иностранному физическому или иностранному
          юридическому лицу.<br />2.13. Уничтожение персональных данных – любые
          действия, в результате которых персональные данные уничтожаются
          безвозвратно с невозможностью дальнейшего восстановления содержания
          персональных данных в информационной системе персональных данных и
          (или) уничтожаются материальные носители персональных данных.<br /><br />3.
          ЦЕЛИ СБОРА ПЕРСОНАЛЬНЫХ ДАННЫХ<br />3.1. Цели обработки персональных
          данных Пользователя:<br />
          <li>
            установления с Пользователем обратной связи, включая направление
            уведомлений, запросов, касающихся использования Сайта, оказания
            услуг, обработку запросов и заявок от Пользователя;
          </li>
          <br />
          <li>
            сбора информации о действиях Пользователей на Сайте, улучшения
            качества Сайта и его содержания (обезличенные данные).
          </li>
          <br />3.2. Оператор имеет право направлять Пользователю уведомления о
          новых продуктах и услугах, специальных предложениях и различных
          событиях. Пользователь всегда может отказаться от получения
          информационных сообщений, направив Оператору письмо на адрес
          электронной почты info@vladagroup.ru с пометкой «Отказ от
          уведомлений».<br />3.3. Обезличенные данные Пользователей, собираемые
          с помощью сервисов интернет-статистики, служат для сбора информации о
          действиях Пользователей на сайте, улучшения качества сайта и его
          содержания.<br /><br />4. ПРАВОВЫЕ ОСНОВАНИЯ И ПЕРЕЧЕНЬ ОБРАБАТЫВАЕМЫХ
          ПЕРСОНАЛЬНЫХ ДАННЫХ<br />4.1. Оператор обрабатывает персональные
          данные Пользователя только в случае их заполнения и/или отправки
          Пользователем самостоятельно через специальные формы, расположенные на
          сайте https://vladagroup.ru/. Заполняя соответствующие формы и/или
          отправляя свои персональные данные Оператору, Пользователь выражает
          свое согласие с данной Политикой.<br />4.2. Оператор обрабатывает
          следующие персональные данные Пользователя:<br />
          <li>фамилия, имя, отчество;</li>
          <br />
          <li>адрес электронной почты;</li>
          <br />
          <li>номера телефонов;</li>
          <br />
          <li>
            обезличенные данные о посетителях (в т.ч. файлы «cookie») с помощью
            сервисов интернет-статистики (Яндекс Метрика, Гугл Аналитика и
            других).
          </li>
          <br />4.3. Обработка персональных данных осуществляется на основе
          принципов:<br />- законности и справедливой основы;<br />- ограничения
          обработки персональных данных достижением конкретных, заранее
          определенных и законных целей;<br />- недопущения обработки
          персональных данных, несовместимой с целями сбора персональных
          данных.<br />4.4. Оператор осуществляет обработку персональных данных
          субъекта только при наличии хотя бы одного из следующих условий:<br />-
          обработка персональных данных осуществляется с согласия субъекта
          персональных данных на обработку его персональных данных;<br />-
          обработка персональных данных необходима для исполнения договора,
          стороной которого либо выгодоприобретателем или поручителем по
          которому является субъект персональных данных.<br /><br />5.
          ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ<br />5.1. Пользователь может получить любые
          разъяснения по интересующим вопросам, касающимся обработки его
          персональных данных, обратившись к Оператору с помощью электронной
          почты info@vladagroup.ru.<br />5.2. В данном документе будут отражены
          любые изменения политики обработки персональных данных Оператором.
          Политика действует бессрочно до замены ее новой версией.<br />5.3.
          Актуальная версия Политики в свободном доступе расположена в сети
          Интернет по адресу [ЗДЕСЬ НУЖНО УКАЗАТЬ ССЫЛКУ НА СТРАНИЦУ С
          ПОЛИТИКОЙ].
        </div>
        <div class="article__shared">
          <div class="article__shared-title">Поделиться</div>
          <div class="article__shared-links">
            <a href="#" @click.prevent="onShareClick">
              <svg
                width="32"
                height="32"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g id="SVGRepo_bgCarrier" stroke-width="0" />

                <g
                  id="SVGRepo_tracerCarrier"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                />

                <g id="SVGRepo_iconCarrier">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M19.6495 0.799565C18.4834 -0.72981 16.0093 0.081426 16.0093 1.99313V3.91272C12.2371 3.86807 9.65665 5.16473 7.9378 6.97554C6.10034 8.9113 5.34458 11.3314 5.02788 12.9862C4.86954 13.8135 5.41223 14.4138 5.98257 14.6211C6.52743 14.8191 7.25549 14.7343 7.74136 14.1789C9.12036 12.6027 11.7995 10.4028 16.0093 10.5464V13.0069C16.0093 14.9186 18.4834 15.7298 19.6495 14.2004L23.3933 9.29034C24.2022 8.2294 24.2022 6.7706 23.3933 5.70966L19.6495 0.799565ZM7.48201 11.6095C9.28721 10.0341 11.8785 8.55568 16.0093 8.55568H17.0207C17.5792 8.55568 18.0319 9.00103 18.0319 9.55037L18.0317 13.0069L21.7754 8.09678C22.0451 7.74313 22.0451 7.25687 21.7754 6.90322L18.0317 1.99313V4.90738C18.0317 5.4567 17.579 5.90201 17.0205 5.90201H16.0093C11.4593 5.90201 9.41596 8.33314 9.41596 8.33314C8.47524 9.32418 7.86984 10.502 7.48201 11.6095Z"
                    fill="#66cb01"
                  />
                  <path
                    d="M7 1.00391H4C2.34315 1.00391 1 2.34705 1 4.00391V20.0039C1 21.6608 2.34315 23.0039 4 23.0039H20C21.6569 23.0039 23 21.6608 23 20.0039V17.0039C23 16.4516 22.5523 16.0039 22 16.0039C21.4477 16.0039 21 16.4516 21 17.0039V20.0039C21 20.5562 20.5523 21.0039 20 21.0039H4C3.44772 21.0039 3 20.5562 3 20.0039V4.00391C3 3.45162 3.44772 3.00391 4 3.00391H7C7.55228 3.00391 8 2.55619 8 2.00391C8 1.45162 7.55228 1.00391 7 1.00391Z"
                    fill="#66cb01"
                  />
                </g>
              </svg>
            </a>
          </div>
        </div>
      </div>
    </div>
  </main>
</template>

<script setup lang="ts">
import { share } from "~/helpers/utils";

const breadcrumbs = [
  { title: "Главная", link: "/" },
  { title: "Политика конфиденциальности", link: "" },
];

useHead({
  title: "Vlada Group — Политика конфиденциальности",
  meta: [
    {
      name: "keywords",
      content: "Политика конфиденциальности",
    },
    {
      name: "description",
      content:
        "Мы не используем ваши персональные данные для передачи третьим лицам.",
    },
    {
      property: "og:title",
      content: "Vlada Group — Политика конфиденциальности",
    },
    {
      property: "og:description",
      content:
        "Мы не используем ваши персональные данные для передачи третьим лицам",
    },
    { property: "og:image", content: "/images/about-vlada.jpg" },
  ],
});

function scrollToElem(className: string, behavior: ScrollBehavior = "smooth") {
  const el = document.querySelector(className);
  if (el) {
    const offsetTop = el.getBoundingClientRect().top + window.scrollY;
    window.scrollTo({
      top: offsetTop,
      behavior,
    });
  } else {
    console.warn(`Element with class "${className}" not found.`);
  }
}

function onShareClick() {
  share("Vlada", "Vlada", "/images/about-vlada.jpg");
}
</script>
